### Read from MySQL Database and run SQL Commands:

In [1]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import os

In [2]:
engine1 = create_engine("mysql+pymysql://piuser:Pass%40123@localhost:3306/piit")
engine1

Engine(mysql+pymysql://piuser:***@localhost:3306/piit)

In [3]:
pd.read_sql("SHOW DATABASES;", engine1)

             Database
0  information_schema
1  performance_schema
2                piit

In [5]:
pd.read_sql('show tables;', engine1)

                             Tables_in_piit
0                                  customer
1                                  employee
2                                   netflix
3  select * from netflix where rating = 16+
4                                 students2
5                        tv shows - netflix

In [6]:
pd.read_sql('select * from employee;', engine1)

   employee_id first_name last_name department   salary
0            1       John       Doe         HR  50000.0
1            2       Jane     Smith         IT  60000.0
2            3      Alice   Johnson    Finance  55000.0
3            4        Bob  Williams         IT  62000.0
4            5      Emily     Brown         HR  48000.0
5          101       John       Doe         HR  50000.0
6          102       Jane     Smith         IT  60000.0
7          103      Alice   Johnson    Finance  55000.0
8          104        Bob  Williams         IT  62000.0
9          105      Emily     Brown         HR  48000.0

In [7]:
pd.read_sql("select * from employee where department='IT';", engine1)

   employee_id first_name last_name department   salary
0            2       Jane     Smith         IT  60000.0
1            4        Bob  Williams         IT  62000.0
2          102       Jane     Smith         IT  60000.0
3          104        Bob  Williams         IT  62000.0